In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
d={"usn":[100,101,102],
   "name":["jithu","rocky","ramesh"],
   "mobile":[30,20,50],
   "marks":[80,60,None]
  }

In [5]:
std=pd.DataFrame(d)

In [6]:
std

   usn    name  mobile  marks
0  100   jithu      30   80.0
1  101   rocky      20   60.0
2  102  ramesh      50    NaN

In [7]:
std.head()

   usn    name  mobile  marks
0  100   jithu      30   80.0
1  101   rocky      20   60.0
2  102  ramesh      50    NaN

In [8]:
std.tail()

   usn    name  mobile  marks
0  100   jithu      30   80.0
1  101   rocky      20   60.0
2  102  ramesh      50    NaN

In [9]:
std.columns

Index(['usn', 'name', 'mobile', 'marks'], dtype='object')

In [10]:
std.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   usn     3 non-null      int64
 1   name    3 non-null      object
 2   mobile  3 non-null      int64
 3   marks   2 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 224.0+ bytes

In [11]:
std.isnull()

     usn   name  mobile  marks
0  False  False   False  False
1  False  False   False  False
2  False  False   False   True

In [12]:
std

   usn    name  mobile  marks
0  100   jithu      30   80.0
1  101   rocky      20   60.0
2  102  ramesh      50    NaN

In [13]:
std["usn"]

0    100
1    101
2    102
Name: usn, dtype: int64

In [14]:
std["name"]

0     jithu
1     rocky
2    ramesh
Name: name, dtype: object

In [15]:
std[["name","marks"]]

     name  marks
0   jithu   80.0
1   rocky   60.0
2  ramesh    NaN

In [16]:
std

   usn    name  mobile  marks
0  100   jithu      30   80.0
1  101   rocky      20   60.0
2  102  ramesh      50    NaN

In [17]:
std.loc[1]

usn         101
name      rocky
mobile       20
marks      60.0
Name: 1, dtype: object

In [18]:
std.iloc[1]

usn         101
name      rocky
mobile       20
marks      60.0
Name: 1, dtype: object

In [19]:
index=["a","b","c"]
std.set_index("usn")

       name  mobile  marks
usn
100   jithu      30   80.0
101   rocky      20   60.0
102  ramesh      50    NaN

In [22]:
std

   usn    name  mobile  marks
0  100   jithu      30   80.0
1  101   rocky      20   60.0
2  102  ramesh      50    NaN

In [23]:
newdf=std["marks"]>=30

In [24]:
std[newdf]["name"]

0    jithu
1    rocky
Name: name, dtype: object

In [25]:
std[(std["name"]=="jithu")
    &(std["marks"]>20)]

   usn   name  mobile  marks
0  100  jithu      30   80.0

In [28]:
std[(std["usn"]>100)&(std["marks"]<100)]

   usn   name  mobile  marks
1  101  rocky      20   60.0

In [29]:
s="nandya,delhi,kurnool".split(',')

In [30]:
print(s,type(s))

['nandya', 'delhi', 'kurnool'] <class 'list'>

In [31]:
std["address"]=s

In [32]:
std

   usn    name  mobile  marks  address
0  100   jithu      30   80.0   nandya
1  101   rocky      20   60.0    delhi
2  102  ramesh      50    NaN  kurnool

In [35]:
std.drop("address",axis=1,inplace=True)

In [36]:
std

   usn    name  mobile  marks
0  100   jithu      30   80.0
1  101   rocky      20   60.0
2  102  ramesh      50    NaN

In [37]:
std.drop(1)

   usn    name  mobile  marks
0  100   jithu      30   80.0
2  102  ramesh      50    NaN

In [38]:
std

   usn    name  mobile  marks
0  100   jithu      30   80.0
1  101   rocky      20   60.0
2  102  ramesh      50    NaN

In [45]:

std

   usn    name  mobile  marks
0  100   jithu      30   80.0
1  101   rocky      20   60.0
2  102  ramesh      50    NaN

In [46]:
std.dropna()

   usn   name  mobile  marks
0  100  jithu      30   80.0
1  101  rocky      20   60.0

In [48]:
std.fillna(100)

   usn    name  mobile  marks
0  100   jithu      30   80.0
1  101   rocky      20   60.0
2  102  ramesh      50  100.0

In [50]:
std.dropna(thresh=4)

   usn   name  mobile  marks
0  100  jithu      30   80.0
1  101  rocky      20   60.0